app/controllers/communities_controller.rb

   def show
   @community = Community.find(params[:id])
---
SELECT * FROM `communities` WHERE (`communities`.`id` = 1)

  def create
   @community = Community.new(params[:community])
   @community.save!
---
INSERT INTO `communities` (`name`, `city`, `moderator`, `commtype`, `description`, `state`) VALUES('UIC', 'Chicago', 'm@c.com', 'Workplace', 'Work community', 'IL')

 def update
   @community = Community.find(params[:id])
   @community.attributes = params[:community]
   @community.save!
---
SELECT * FROM `communities` WHERE (`communities`.`id` = 2)
UPDATE `communities` SET `commtype` = 'College' WHERE `id` = 2