app/controllers/notifications_controller.rb

   def show
   @notification = Notification.find(params[:id])
---
SELECT * FROM `notifications` WHERE (`notifications`.`id` = 1)

  def create
   @notification = Notification.new(params[:notification])
   @notification.save!
---
INSERT INTO `notifications` (`sent_time`, `sender`, `recipient`, `message`) VALUES(NULL, 'maheshm1984@yahoo.co.in', 'John@doe.com', 'I am interested.')

 def update
   @notification = Notification.find(params[:id])
   @notification.attributes = params[:notification]
   @notification.save!
---
SELECT * FROM `notifications` WHERE (`notifications`.`id` = 1)
UPDATE `notifications` SET `message` = 'Hmm' WHERE `id` = 1