app/controllers/offer_requests_controller.rb

SELECT * FROM `offer_requests` WHERE (`offer_requests`.`id` = 1)
---
   def show
   @offer_request = OfferRequest.find(params[:id])

SELECT * FROM `offer_requests` WHERE (`offer_requests`.`startPoint` IS NULL) LIMIT 1
---
   def show
    @offer_request = OfferRequest.find_by_startPoint(params[:startPoint])

INSERT INTO `offer_requests` (`additionalText`, `endPoint`, `startPoint`, `madeby`, `time`, `date`, `searchType`, `requestType`) VALUES('yo yo yo Yo ', 'dombivli', 'thane', 'fff@gg.com', '2000-01-01 08:00:00', '2010-08-15', '(null)', 'O')
---
  def create
   @offer_request = OfferRequest.new(params[:offer_request])
   @offer_request.save!

SELECT * FROM `offer_requests` WHERE (`offer_requests`.`id` = 1)
UPDATE `offer_requests` SET `endPoint` = 'Hell' WHERE `id` = 1
---
 def update
   @offer_request = OfferRequest.find(params[:id])
   @offer_request.attributes = params[:offer_request]
   @offer_request.save!