app/controllers/user_communities_controller.rb

SELECT * FROM `user_communities` WHERE (`user_communities`.`id` = 1)
---
   def show
   @user_community = UserCommunity.find(params[:id])

INSERT INTO `user_communities` (`moderator`, `user`, `community`) VALUES('N', 'E@f.com', 'UIC')
---
  def create
   @user_community = UserCommunity.new(params[:user_community])
   @user_community.save!