app/controllers/users_controller.rb

   def show
   @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
   @user = User.new(params[:user])
   @user.save!
---
INSERT INTO `users` (`dob`, `location`, `cre_date_time`, `usertype`, `sex`, `password`, `email`) VALUES('1978-10-20', 'Mumbai', NULL, 'Student', 'F', 'ggg', 'm@c.com')

 def update
   @user = User.find(params[:id])
   @user.attributes = params[:user]
   @user.save!
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `email` = 'm@c.com' WHERE `id` = 1

 def destroy
   @user  = User.find(params[:id])
   @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3